"""
Длина Московской кольцевой автомобильной дороги —109 километров. Стартуем с нулевого километра МКАД и едем со скоростью V километров в час. На какой отметке остановимся через T часов? Программа получает на вход значение V и T. Если V>0, то движемся в положительном направлении по МКАД, если же значение V<0, то в отрицательном. Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановимся.
"""

mkad = 0
length = 109
v = int (input('Введите скорость, км/ч:'))
t = int (input('Через сколько часов остановимся:'))
way = v*t

if v>0:
  way2 = way//109 
  way %=109 
  print ('Автомобиль проехал',way,'киллометров и',way2,'круг(а/ов)',)
  
else:
  way2 = way//109
  way %=-109
  -way
  print ('Автомобиль проехал',way,'киллометров и',-way2,'круг(а/ов)',)
