"""
Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада. Вклад составляет X рублей Y копеек. Определите размер вклада через год. Программа получает на вход целые числа P, X, Y и должна вывести два числа: величину вклада через год в рублях и копейках. Дробная часть копеек отбрасывается.
"""

p = int (input('% ставка, годовых:'))
x = int (input('Сумма вклада, руб.:'))
y = int (input('Сумма вклада, коп.:'))
sum = ((x * 100) + y)/100
sum = (sum*p+((x * 100) + y))
rub = sum//100
kop = sum%100
print ('Ваш вклад через год составит:',rub,'рублей',kop,'копеек',)
